saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/MindMotion.MM32F031_DFP.1.3.7.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
	<vendor>MindMotion</vendor>
	<url>http://www.mindmotion.com.cn/Download/MDK_KEIL/</url>
	<name>MM32F031_DFP</name>
	<description>MindMotion MM32F031 Series Device Support, Drivers and Examples</description>
	<releases>
		<release version="1.3.7">
      First Release version of MM32F031 Device Family Pack.
    </release>
	</releases>
	<keywords>
		<!-- keywords for indexing -->
		<keyword>MindMotion</keyword>
		<keyword>Device Support</keyword>
		<keyword>Device Family Package MindMotion</keyword>
		<keyword>MM32F031</keyword>
		<keyword>MM32</keyword>
	</keywords>
	<devices>
		<!-- generated, do not modify this section! -->
		<family Dfamily="MM32F031 Series" Dvendor="MindMotion:132">
			<processor Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
			<description>
				MM32F031 - ARM Cortex-M0 Core
				Frequency up to 72 MHz, Flash up to 64 KB, SRAM up to 8 KB, Support power saving mode: sleep, and standby mode

				Analog peripherals 10 channels x 12bit, 1us ADC, Up to 2 x UART, Up to 2 x SPI (18Mbit/s), Up to 1 x I2C (400Kbit/s)
				On-chip resources include : 1 x Advanced Timer, 1 x SysTick Timer, 2 x WDG , 1 x DMA supported, Clock: HSI (48MHz) and LSI (40KHz)

				Core ARM Cortex-M0, 72 MHz 
				Memory 8 kB RAM, 64 kB ROM 
				Clock 72 MHz 
				Communication Other 
				Timer/Counter/PWM 
				Analog 10-channel 12 bit ADC 
			</description>
			<!-- ************************  Subfamily 'MM32F031x8'  **************************** -->
			<subFamily DsubFamily="MM32F031x8">
				<processor Dclock="72000000"/>
				<!-- *************************  Device 'MM32F031C8T'  ***************************** -->
				<device Dname="MM32F031C8T">
					<processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
					<compile header="Device/MM32F031xxn/Include/HAL_device.h" define="MM32F031C8T"/>
					<debug svd="SVD/MM32F031xx.svd"/>
					<memory id="IROM1" start="0x08000000" size="0x10000" startup="1" default="1"/>
					<memory id="IRAM1" start="0x20000000" size="0x2000" init="0" default="1"/>
					<algorithm name="Flash/MM32F031xxn_64.FLM" start="0x08000000" size="0x10000" default="1"/>
					<book name="Documents/MM32F031/PB_MM32F031xxn.pdf" title="MM32F031 Product Brief"/>
					<book name="Documents/MM32F031/DS_MM32F031xxn.pdf" title="MM32F031 Datasheet"/>
				</device>
				<device Dname="MM32F031K8T">
					<processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
					<compile header="Device/MM32F031xxn/Include/HAL_device.h" define="MM32F031K8T"/>
					<debug svd="SVD/MM32F031xx.svd"/>
					<memory id="IROM1" start="0x08000000" size="0x10000" startup="1" default="1"/>
					<memory id="IRAM1" start="0x20000000" size="0x2000" init="0" default="1"/>
					<algorithm name="Flash/MM32F031xxn_64.FLM" start="0x08000000" size="0x10000" default="1"/>
					<book name="Documents/MM32F031/PB_MM32F031xxn.pdf" title="MM32F031 Product Brief"/>
					<book name="Documents/MM32F031/DS_MM32F031xxn.pdf" title="MM32F031 Datasheet"/>
				</device>
				<device Dname="MM32F031K8U">
					<processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
					<compile header="Device/MM32F031xxn/Include/HAL_device.h" define="MM32F031K8U"/>
					<debug svd="SVD/MM32F031xx.svd"/>
					<memory id="IROM1" start="0x08000000" size="0x10000" startup="1" default="1"/>
					<memory id="IRAM1" start="0x20000000" size="0x2000" init="0" default="1"/>
					<algorithm name="Flash/MM32F031xxn_64.FLM" start="0x08000000" size="0x10000" default="1"/>
					<book name="Documents/MM32F031/PB_MM32F031xxn.pdf" title="MM32F031 Product Brief"/>
					<book name="Documents/MM32F031/DS_MM32F031xxn.pdf" title="MM32F031 Datasheet"/>
				</device>
			</subFamily>
			<!-- ************************  Subfamily 'MM32F031x6'  **************************** -->
			<subFamily DsubFamily="MM32F031x6">
				<processor Dclock="72000000"/>
				<!-- *************************  Device 'MM32F031x6'  ***************************** -->
				<device Dname="MM32F031C6T">
					<processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
					<compile header="Device/MM32F031xxn/Include/HAL_device.h" define="MM32F031C6T"/>
					<debug svd="SVD/MM32F031xx.svd"/>
					<memory id="IROM1" start="0x08000000" size="0x8000" startup="1" default="1"/>
					<memory id="IRAM1" start="0x20000000" size="0x1000" init="0" default="1"/>
					<algorithm name="Flash/MM32F031xxn_32.FLM" start="0x08000000" size="0x8000" default="1"/>
					<book name="Documents/MM32F031/PB_MM32F031xxn.pdf" title="MM32F031 Product Brief"/>
					<book name="Documents/MM32F031/DS_MM32F031xxn.pdf" title="MM32F031 Datasheet"/>
				</device>
				<device Dname="MM32F031K6T">
					<processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
					<compile header="Device/MM32F031xxn/Include/HAL_device.h" define="MM32F031K6T"/>
					<debug svd="SVD/MM32F031xx.svd"/>
					<memory id="IROM1" start="0x08000000" size="0x8000" startup="1" default="1"/>
					<memory id="IRAM1" start="0x20000000" size="0x1000" init="0" default="1"/>
					<algorithm name="Flash/MM32F031xxn_32.FLM" start="0x08000000" size="0x8000" default="1"/>
					<book name="Documents/MM32F031/PB_MM32F031xxn.pdf" title="MM32F031 Product Brief"/>
					<book name="Documents/MM32F031/DS_MM32F031xxn.pdf" title="MM32F031 Datasheet"/>
				</device>
				<device Dname="MM32F031K6U">
					<processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
					<compile header="Device/MM32F031xxn/Include/HAL_device.h" define="MM32F031K6U"/>
					<debug svd="SVD/MM32F031xx.svd"/>
					<memory id="IROM1" start="0x08000000" size="0x8000" startup="1" default="1"/>
					<memory id="IRAM1" start="0x20000000" size="0x1000" init="0" default="1"/>
					<algorithm name="Flash/MM32F031xxn_32.FLM" start="0x08000000" size="0x8000" default="1"/>
					<book name="Documents/MM32F031/PB_MM32F031xxn.pdf" title="MM32F031 Product Brief"/>
					<book name="Documents/MM32F031/DS_MM32F031xxn.pdf" title="MM32F031 Datasheet"/>
				</device>
				<device Dname="MM32F031G6U">
					<processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
					<compile header="Device/MM32F031xxn/Include/HAL_device.h" define="MM32F031G6U"/>
					<debug svd="SVD/MM32F031xx.svd"/>
					<memory id="IROM1" start="0x08000000" size="0x8000" startup="1" default="1"/>
					<memory id="IRAM1" start="0x20000000" size="0x1000" init="0" default="1"/>
					<algorithm name="Flash/MM32F031xxn_32.FLM" start="0x08000000" size="0x8000" default="1"/>
					<book name="Documents/MM32F031/PB_MM32F031xxn.pdf" title="MM32F031 Product Brief"/>
					<book name="Documents/MM32F031/DS_MM32F031xxn.pdf" title="MM32F031 Datasheet"/>
				</device>
				<device Dname="MM32F031F6P">
					<processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
					<compile header="Device/MM32F031xxn/Include/HAL_device.h" define="MM32F031F6P"/>
					<debug svd="SVD/MM32F031xx.svd"/>
					<memory id="IROM1" start="0x08000000" size="0x8000" startup="1" default="1"/>
					<memory id="IRAM1" start="0x20000000" size="0x1000" init="0" default="1"/>
					<algorithm name="Flash/MM32F031xxn_32.FLM" start="0x08000000" size="0x8000" default="1"/>
					<book name="Documents/MM32F031/PB_MM32F031xxn.pdf" title="MM32F031 Product Brief"/>
					<book name="Documents/MM32F031/DS_MM32F031xxn.pdf" title="MM32F031 Datasheet"/>
				</device>
			</subFamily>
			<!-- ************************  Subfamily 'MM32F031x4'  **************************** -->
			<subFamily DsubFamily="MM32F031x4">
				<processor Dclock="72000000"/>
				<!-- *************************  Device 'MM32F031x4'  ***************************** -->
				<device Dname="MM32F031K4U">
					<processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
					<compile header="Device/MM32F031xxn/Include/HAL_device.h" define="MM32F031K4U"/>
					<debug svd="SVD/MM32F031xx.svd"/>
					<memory id="IROM1" start="0x08000000" size="0x4000" startup="1" default="1"/>
					<memory id="IRAM1" start="0x20000000" size="0x1000" init="0" default="1"/>
					<algorithm name="Flash/MM32F031xxn_16.FLM" start="0x08000000" size="0x4000" default="1"/>
					<book name="Documents/MM32F031/PB_MM32F031xxn.pdf" title="MM32F031 Product Brief"/>
					<book name="Documents/MM32F031/DS_MM32F031xxn.pdf" title="MM32F031 Datasheet"/>
				</device>
				<device Dname="MM32F031F4P">
					<processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
					<compile header="Device/MM32F031xxn/Include/HAL_device.h" define="MM32F031F4P"/>
					<debug svd="SVD/MM32F031xx.svd"/>
					<memory id="IROM1" start="0x08000000" size="0x4000" startup="1" default="1"/>
					<memory id="IRAM1" start="0x20000000" size="0x1000" init="0" default="1"/>
					<algorithm name="Flash/MM32F031xxn_16.FLM" start="0x08000000" size="0x4000" default="1"/>
					<book name="Documents/MM32F031/PB_MM32F031xxn.pdf" title="MM32F031 Product Brief"/>
					<book name="Documents/MM32F031/DS_MM32F031xxn.pdf" title="MM32F031 Datasheet"/>
				</device>
			</subFamily>
		</family>
	</devices>
	<conditions>
		<!-- conditions are dependency rules that can apply to a component or an individual file -->
		<!-- Compiler Conditions -->
		<condition id="Compiler ARMCC">
			<require Tcompiler="ARMCC"/>
		</condition>
		<!-- add 20170801 start -->
		<condition id="Cortex-M Device">
			<description>Cortex-M processor based device: one of CM0, CM0+, CM3, CM4, CM7, SC000, SC3000</description>
			<accept Dcore="Cortex-M0"/>
		</condition>
		<condition id="ARMCC Cortex-M">
			<description>ARMCC and Cortex-M</description>
			<require Tcompiler="ARMCC"/>
			<require condition="Cortex-M Device"/>
		</condition>
		<condition id="Cortex-M Device CMSIS Core">
			<description>ARM Cortex-M device that depends on CMSIS Core component</description>
			<require condition="Cortex-M Device"/>
			<require Cclass="CMSIS" Cgroup="CORE"/>
		</condition>
		<condition id="Cortex-M Device Startup">
			<description>Only show for Cortex-M based devices. Depends on Device Startup component.</description>
			<require condition="Cortex-M Device"/>
			<require Cclass="Device" Cgroup="Startup"/>
		</condition>
		<condition id="CMSIS Core">
			<description>CMSIS CORE processor and device specific Startup files</description>
			<require Cclass="CMSIS" Cgroup="CORE"/>
			<require Dvendor="MindMotion:132" Dname="MM32F031*"/>
		</condition>
	</conditions>
	<components>
		<component Cclass="Device" Cgroup="Startup" Cversion="1.0.4" condition="CMSIS Core">
			<description>System Startup for MindMotion MM32F031xxn Series devices</description>
			<files>
				<file category="header" name="Device/MM32F031xxn/Include/HAL_device.h"/>
				<file category="header" name="Device/MM32F031xxn/Source/system_MM32F031xxn.h"/>
				<file category="sourceC" name="Device/MM32F031xxn/Source/system_MM32F031xxn.c" attr="config" version="1.0.4"/>
				<file category="sourceAsm" name="Device/MM32F031xxn/Source/KEIL_StartAsm/startup_MM32F031xxn_KEIL.s" attr="config" version="1.0.4" condition="Compiler ARMCC"/>
			</files>
		</component>
	</components>
	<boards>
		<board vendor="MindMotion" name="MM32_MBF031xxn_Board" revision="Ver 1.0">
			<description>MindMotion MM32_MBF031xxn_Board Development Board</description>
			<image small="Images/MiniBoard_small.jpg" large="Images/MiniBoard_big.jpg"/>
			<book category="schematic" name="Documents/boards/MM32_MiniBoard_Schematic_Ver1_1.pdf" title="MM32_MBF031_Board Schematics"/>
			<book category="manual" name="Documents/boards/PB_MM32_MiniBoard_Ver1_1.pdf" title="MM32_MBF031_Board Product Brief"/>
			<book category="manual" name="Documents/boards/QS_MiniBoard_Quick_Start_Guide_Ver1_2.pdf" title="MM32_MBF031_Board Quick Start Guide"/>
			<book category="manual" name="Documents/boards/UM_MM32_MiniBoard_Ver1_1.pdf" title="MM32_MBF031_Board UserManual"/>
			<mountedDevice deviceIndex="0" Dvendor="MindMotion:132" Dname="MM32F031C8T"/>
			<compatibleDevice deviceIndex="0" Dvendor="MindMotion:132" DsubFamily="MM32F031x8"/>
			<compatibleDevice deviceIndex="0" Dvendor="MindMotion:132" DsubFamily="MM32F031x6"/>
			<compatibleDevice deviceIndex="0" Dvendor="MindMotion:132" DsubFamily="MM32F031x4"/>
			<feature type="XTAL" n="8000000"/>
			<feature type="PWR" n="5" name="USB Powered"/>
			<feature type="PWR" n="3" m="5" name="External Supply"/>
			<feature type="Button" n="1" name="Push-buttons: Reset"/>
			<feature type="LED" n="2" name="LEDs: Power, One user"/>
			<debugInterface adapter="JTAG/SW" connector="20 pin JTAG (0.1 inch connector)"/>
		</board>
	</boards>
	<examples>
		<!-- MM32_MBF031x8_Board Core Board -->
		<example name="MM32_MBF031xxn_Board GPIO LED blinky" doc="README.TXT" folder="Boards/MBF031_Boardreg/RegSample/GPIO_LED">
			<description>MM32_MBF031xxn_Board Blinky example</description>
			<board name="MM32_MBF031xxn_Board" vendor="MindMotion"/>
			<project>
				<environment name="uv" load="KEILPRJ/BLINK.uvprojx"/>
			</project>
			<attributes>
				<component Cclass="CMSIS" Cgroup="CORE"/>
				<component Cclass="Device" Cgroup="Startup"/>
				<category>Getting Started</category>
			</attributes>
		</example>
	</examples>
</package>
